20220621/Catalogs/тм_АвтомобилиКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>тм_АвтомобилиКлиентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКузова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тм_Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаАвто</Name>
					<Comment>Реквизит нужен только для обработки полей представления</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.тм_МаркаАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельАвто</Name>
					<Comment>Реквизит нужен только для обработки полей представления</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.тм_МодельАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельКузова</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тм_МодельКузова</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

20220621/Catalogs/тм_АвтомобилиКлиентов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ГосударственныйНомер = ВРЕГ(ТекущийОбъект.ГосударственныйНомер);
	ТекущийОбъект.VIN = ВРЕГ(ТекущийОбъект.VIN);
	ТекущийОбъект.Регион = ВРЕГ(ТекущийОбъект.Регион);
	ТекущийОбъект.НомерКузова = ВРЕГ(ТекущийОбъект.НомерКузова);
	ТекущийОбъект.НомерДвигателя = ВРЕГ(ТекущийОбъект.НомерДвигателя);
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГосударственныйНомерИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Отказ = Ложь;
	ПроверитьВводРеквизита(Элемент.Имя, Отказ, Текст);
	Если Отказ Тогда
		Объект.ГосударственныйНомер = "";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура VINИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Отказ = Ложь;
	ПроверитьВводРеквизита(Элемент.Имя, Отказ, Текст, Ложь);
	Если Отказ Тогда
		Объект.VIN = "";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НомерКузоваИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отказ = Ложь;
	ПроверитьВводРеквизита(Элемент.Имя, Отказ, Текст, Ложь);
	Если Отказ Тогда
		Объект.НомерКузова = "";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДвигателяИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отказ = Ложь;
	ПроверитьВводРеквизита(Элемент.Имя, Отказ, Текст, Ложь);
	Если Отказ Тогда
		Объект.НомерДвигателя = "";
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура АвтомобильПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Автомобиль) Тогда
		Объект.МаркаАвто = Неопределено;
		Объект.МодельАвто = Неопределено;
		Объект.МодельДвигателя = Неопределено;
	Иначе
		Объект.МаркаАвто = Объект.Автомобиль.МаркаАвто;
		Объект.МодельАвто = Объект.Автомобиль.МодельАвто;
		Объект.МодельДвигателя = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	
	АвтомобильПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
&НаКлиенте
Процедура ПроверитьВводРеквизита(ПроверяемыйРеквизит, Отказ, Текст, ПроверитьТолькоКириллица = Истина)

	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;  
	
	ДопустимыеСимволы = "0123456789";
	Если ПроверитьТолькоКириллица Тогда			
		Если Не СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Текст,, ДопустимыеСимволы) Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Необходимо вводить символы русского языка";
			Сообщение.Поле  = ПроверяемыйРеквизит;
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить(); 
		КонецЕсли; 			
	Иначе
		Если Не СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Текст,, ДопустимыеСимволы) Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Необходимо вводить символы английского языка";
			Сообщение.Поле = ПроверяемыйРеквизит;
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();	
		КонецЕсли;			
	КонецЕсли; 		

КонецПроцедуры

#КонецОбласти
